neighborhoodblog/app/controllers/api/styles_controller.rb

SELECT  "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @style = Style.find(params[:id])